# SubCategoryId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContourSettingItem..::..SubCategoryId Property
ContourSettingItem Class See Also
---
The contour line style subcategory id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ElementId SubCategoryId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SubCategoryId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ SubCategoryId {
	ElementId^ get ();
}
```

# See Also
ContourSettingItem Class
Autodesk.Revit.DB Namespace